app/controllers/palestras_controller.rb

SELECT "palestras".* FROM "palestras"
---
  def index
    @palestras = Palestra.all

INSERT INTO "palestras" ("nome", "duracao", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nome", "Lógica de Programação em Ruby on Rails"], ["duracao", 50], ["created_at", "2023-10-20 16:09:52.805275"], ["updated_at", "2023-10-20 16:09:52.805275"]]
---
  def create
    @palestra = Palestra.new(palestra_params)

    respond_to do |format|
      if @palestra.save

DELETE FROM "palestras" WHERE "palestras"."id" = $1  [["id", 18]]
---
  def destroy
    @palestra.destroy!

SELECT "palestras".* FROM "palestras" WHERE "palestras"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_palestra
      @palestra = Palestra.find(params[:id])